SOAPRequest_Classif.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header><Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><UsernameToken><Username>PASSPORT_USER</Username><Password>*****</Password></UsernameToken><Sign></Sign><Key></Key><Hash></Hash><SignDate>2017-02-08T11:24:25</SignDate></Security></SOAP-ENV:Header><SOAP-ENV:Body><cl_request xmlns="http://gisun.agatsystem.by/classif/types/"><cover xmlns=""><message_id xmlns="http://gisun.agatsystem.by/common/types/">{A22958B4-E6D8-4C60-B828-54E574754563}</message_id><message_type xmlns="http://gisun.agatsystem.by/common/types/"><code>141</code><type>141</type></message_type><message_time xmlns="http://gisun.agatsystem.by/common/types/">2017-02-08T11:24:25.115+03:00</message_time><message_source xmlns="http://gisun.agatsystem.by/common/types/"><code>3</code><type>142</type></message_source></cover><request xmlns=""><cl_type>141</cl_type><date_from>1990-01-01T00:00:00.000+03:00</date_from></request></cl_request></SOAP-ENV:Body></SOAP-ENV:Envelope>
